//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameLibSystem.h
//!
//! @brief  DxLibのシステム関連への追加機能のヘッダファイル
//!
//! @date   2017/3/27
//!
//! @author 高木 晋
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================
#define EXIT_KEY (KEY_INPUT_ESCAPE)    // 強制終了キー




// 関数の宣言 ==============================================================

// ゲームシステムの更新
void UpdateSystem(void);

// ゲームの終了
void ExitGame(void);
